espressif/esp-iot-solution/examples/keyboard/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP=y
CONFIG_ESP_PHY_MAC_BB_PD=y
CONFIG_PM_ENABLE=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAX_CPU_FREQ_MHZ=240
CONFIG_ESP_MIN_CPU_FREQ_MHZ=160
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_MATRIX_ROWS=6
CONFIG_MATRIX_COLS=15
CONFIG_MATRIX_LED_COUNT=82
CONFIG_ENABLE_RGB_MATRIX_TYPING_HEATMAP=y
CONFIG_ENABLE_RGB_MATRIX_DIGITAL_RAIN=y
CONFIG_ENABLE_RGB_MATRIX_SPLASH=y
CONFIG_ENABLE_RGB_MATRIX_MULTISPLASH=y
CONFIG_ENABLE_RGB_MATRIX_SOLID_SPLASH=y
CONFIG_ENABLE_RGB_MATRIX_SOLID_MULTISPLASH=y
CONFIG_ENABLE_RGB_MATRIX_BREATHING=y
CONFIG_ENABLE_RGB_MATRIX_BAND_PINWHEEL_SAT=y
CONFIG_ENABLE_RGB_MATRIX_BAND_PINWHEEL_VAL=y
CONFIG_ENABLE_RGB_MATRIX_BAND_SAT=y
CONFIG_ENABLE_RGB_MATRIX_BAND_SPIRAL_SAT=y
CONFIG_ENABLE_RGB_MATRIX_BAND_SPIRAL_VAL=y
CONFIG_ENABLE_RGB_MATRIX_CYCLE_OUT_IN=y
CONFIG_ENABLE_RGB_MATRIX_CYCLE_OUT_IN_DUAL=y
CONFIG_ENABLE_RGB_MATRIX_CYCLE_PINWHEEL=y
CONFIG_ENABLE_RGB_MATRIX_CYCLE_SPIRAL=y
CONFIG_ENABLE_RGB_MATRIX_CYCLE_UP_DOWN=y
CONFIG_ENABLE_RGB_MATRIX_DUAL_BEACON=y
CONFIG_ENABLE_RGB_MATRIX_FLOWER_BLOOMING=y
CONFIG_ENABLE_RGB_MATRIX_GRADIENT_LEFT_RIGHT=y
CONFIG_ENABLE_RGB_MATRIX_GRADIENT_UP_DOWN=y
CONFIG_ENABLE_RGB_MATRIX_HUE_WAVE=y
CONFIG_ENABLE_RGB_MATRIX_JELLYBEAN_RAINDROPS=y
CONFIG_ENABLE_RGB_MATRIX_PIXEL_RAIN=y
CONFIG_ENABLE_RGB_MATRIX_RAINBOW_BEACON=y
CONFIG_ENABLE_RGB_MATRIX_RAINBOW_MOVING_CHEVRON=y
CONFIG_ENABLE_RGB_MATRIX_RAINBOW_PINWHEELS=y
CONFIG_ENABLE_RGB_MATRIX_RIVERFLOW=y
CONFIG_ENABLE_RGB_MATRIX_STARLIGHT_DUAL_HUE=y
CONFIG_ENABLE_RGB_MATRIX_STARLIGHT_DUAL_SAT=y
